import { createRoot } from "react-dom/client";
import App from "./App";
import "@fontsource/space-grotesk/400.css";
import "@fontsource/space-grotesk/700.css";
import "@fontsource/source-sans-3/400.css";
import "@fontsource/source-sans-3/600.css";
import "./index.css";
import { initializeGoogleAnalytics } from "./lib/analytics";
import { initializeCookiebot } from "./lib/consent";

// Display EDUCREDS banner
console.log(`
/* ███████╗██████╗ ██╗   ██╗ ██████╗██████╗ ███████╗██████╗ ███████╗ */
/* ██╔════╝██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝██╔══██╗██╔════╝ */
/* █████╗  ██║  ██║██║   ██║██║     ██████╔╝█████╗  ██║  ██║███████╗ */
/* ██╔══╝  ██║  ██║██║   ██║██║     ██╔══██╗██╔══╝  ██║  ██║╚════██║ */
/* ███████╗██████╔╝╚██████╔╝╚██████╗██║  ██║███████╗██████╔╝███████║ */
/* ╚══════╝╚═════╝  ╚═════╝  ╚═════╝╚═╝  ╚═╝╚══════╝╚═════╝ ╚══════╝ */
`);

if (import.meta.env.PROD) {
  initializeCookiebot();
  initializeGoogleAnalytics();
}

createRoot(document.getElementById("root")!).render(<App />);
